Revit 2024 API
FileArgumentAlreadyExistsException Class
The exception that is thrown when the specified file exists.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class FileArgumentAlreadyExistsException : ArgumentException
Visual Basic
<SerializableAttribute> _
Public Class FileArgumentAlreadyExistsException _
	Inherits ArgumentException
Visual C++
[SerializableAttribute]
public ref class FileArgumentAlreadyExistsException : public ArgumentException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
See Also
FileArgumentAlreadyExistsException Members
Autodesk.Revit.Exceptions Namespace